app/Controllers/Api_Product.php

SELECT *
FROM `floor_plan`
---
    public function index()
    {
        $data = $this->product->getProductAll();
        $floor = $this->floorplan->findAll();

SELECT *
FROM `product`
---
    public function getCategory()
    {
        $categories = $this->product->findAll();