app/Controllers/ProductController.php

    public function index()
    {
        helper(['form', 'url']);
        $data['product'] = $this->product->getProductMarkets();
        $data['market'] = $this->market->findAll();
---
SELECT *
FROM `market`

    public function create()
    {
        $data['product'] = $this->product->getProductMarkets();
        $data['category'] = $this->getCategory();
        $data['market'] = $this->market->findAll();
        $data['floorplan'] = $this->floorplan->findAll();
---
SELECT *
FROM `market`
SELECT *
FROM `floor_plan`

    public function edit($id)
    {
        $data['product'] = $this->product->getProductMarketId($id);
        $data['category'] = $this->getCategory();
        $data['market'] = $this->market->findAll();
        $data['floorplan'] = $this->floorplan->findAll();
        $data['floorproduct'] = $this->floorproduct->where('id_product', $id)->find();
        $data['varian'] = $this->varian->where('id_product', $id)->find();
---
SELECT *
FROM `market`
SELECT *
FROM `floor_plan`
SELECT *
FROM `floor_product`
WHERE `id_product` = '28'
SELECT *
FROM `varian`
WHERE `id_product` = '28'

    public function getCategory()
    {
        $categories = $this->product->findAll();
---
SELECT *
FROM `product`