app/Controllers/VarianController.php

    public function index()
    {
        $data['product'] = $this->product->findAll();
---
SELECT *
FROM `product`

    public function create()
    {
        $data['product'] = $this->product->findAll();
        $data['varian'] = $this->varian->findAll();
---
SELECT *
FROM `product`
SELECT *
FROM `varian`

    public function store()
    {
        $nameVarian = $this->request->getPost('name_varian');
        $assetUrl = $this->request->getPost('asset_url');
        $varianImg = $this->request->getFile('picture_varian');
        $id_product = $this->request->getVar('id_product');

        if ($varianImg) {
            // Generate a random name for the file
            $newName = $varianImg->getRandomName();

            // Move the file to the desired directory
            $varianImg->move('./img/', $newName);

            // Prepare the data array
            $data = [
                'name_varian' => $nameVarian,
                'asset_url' => $assetUrl,
                'picture_varian' => $newName,
                'id_product' => $id_product,
            ];

            // Assuming $model is an instance of your model class
            $this->varian->insert($data);
---
INSERT INTO `varian` (`name_varian`, `picture_varian`, `id_product`) VALUES ('dulang', '1705295524_063d88db315b9685bb8a.jpg', '24')